#ifndef _DRAWBOX_H_
#define _DRAWBOX_H_

#include "main.h"

//=============================================================================================================================================//
/* 默认值定义 */
//=============================================================================================================================================//

/* 菜单控件高度 */
extern double MenuH;

/* 菜单控件宽度 */
extern double MenuW;



//=============================================================================================================================================//
/* 函数实现 */
//=============================================================================================================================================//

/* 功能:连接两个控件
 * 参数1:ID1
 * 参数2:ID2
 * 返回值:无
 * 说明:新增一条直线，连接两个控件
 */
void LinkTwoObj(int ID1, int ID2);


/* 功能:画执行框
 * 参数1:对象指针
 * 返回值:无
 * 说明:生成一个执行框
 */
void DrawStartBox(void *StartBox);
void DrawProcedureBox(void *ProcedureBox);
void DrawJudgeBox(void *JudgeBox);

/* 功能:遍历链表,找到给定 ID 对应的对象
 * 参数:对象ID
 * 返回值:找到的对象指针
 */
extern void* SearchObj(int ID);

#endif
