#ifndef _READ_DEFINATION_C_
#define _READ_DEFINATION_C_

#include "definition.h"

//=============================================================================================================================================//
/* 链表定义 */
//=============================================================================================================================================//

/* 每个元素都是一个指向 直线/框链表 的指针 */
linkedlistADT List[5] = {NULL, NULL, NULL, NULL, NULL};

//=============================================================================================================================================//
/* 全局变量定义 */
//=============================================================================================================================================//

/* 每种对象的个数 */
int COUNT[4] = {0, 0, 0, 0};

/* 当前选中的元素,没有选中时为NULL */
void *CURR_OBJ = NULL;
/* 当前选中的元素种类,没有选中时为-1 */
int CURR_OBJ_KIND = -1;

/* 剪切板,指向上一个被复制的对象,没有则为NULL */
void *TEMP = NULL;
/* 剪切板中的对象种类,没有则为-1 */
int TEMP_KIND = -1;

/* 当前编号到第几 */
int CURR_ID = 0;

/* 当前中心点被占据的个数 */
int CURR_OCCUPY = 0;

/* 修改CURR_OCCUPY使能信号 */
bool CURR_OCCUPY_EN = FALSE;

/* 图形元素选中状态 */
bool IS_SELECTED = FALSE;

bool IS_IN_TEXT = FALSE;

bool OUT_OF_TEXT = FALSE;

mode CURR_MODE = EDIT;

//=============================================================================================================================================//
/* 默认值定义 */
//=============================================================================================================================================//

/* 默认绘图属性 */
string SYS_COLOR = "RED";
string SEL_COLOR = "GREEN";
string EDIT_COLOR = "BLACK";
int SYS_PENSIZE = 2;
double WINDOW_X = 1280;
double WINDOW_Y = 720;

/* 默认对象长宽 */
double OBJ_WIDTH = 1.0;
double OBJ_HEIGHT = 0.4;

#endif